#include "header.h"

void showMenu(){
    std::cout<<"1. Перевести число из 10-го формата в 2-й в прямом/обратном/дополгительном кодах.\n";
    std::cout<<"2. Сложить 2 числа в дополнительном коде (вводить в 10-ом формате).\n";
    std::cout<<"3. Вычитание путем комбинации отрицания вычитаемого и сложения с уменьшаемым, все значения находятся в дополнительном коде.\n";
    std::cout<<"4. Умножить 2 числа в прямом коде(числа вводятся в 10-ом формате).\n";
    std::cout<<"5. Деление 2 чисел в прямом коде (числа вводятся в 10-ом формате) с точностью до 5 знаков.\n";
    std::cout<<"6. Складывать/вычитать/умножать/делить 2 числа с плавающей точкой по стандарту IEEE-754-2008.\n";
    std::cout<<"7. Сложить 2 числа в двоично-десятичный коде.\n";
}